Day 2 - Exploratory Data Analysis (EDA) Basics | Understanding Your Data

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('../Datasets/train (1).csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

1. How big is the data?

In [6]:
# Get dataset dimensions
rows, columns = df.shape

print("=" * 50)
print("üìè DATASET DIMENSIONS")
print("=" * 50)
print(f"Total Rows (Records): {rows}")
print(f"Total Columns (Features): {columns}")
print(f"Total Data Points: {rows * columns:,}")
print("=" * 50)

==================================================
üìè DATASET DIMENSIONS
==================================================
Total Rows (Records): 891
Total Columns (Features): 12
Total Data Points: 10,692
==================================================

2. How does the data look like?

In [7]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.0,0,3,2666,19.2583,NaN,C
363,364,0,3,"Asim, Mr. Adola",male,35.0,0,0,SOTON/O.Q. 3101310,7.0500,NaN,S
276,277,0,3,"Lindblom, Miss. Augusta Charlotta",female,45.0,0,0,347073,7.7500,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
223,224,0,3,"Nenkoff, Mr. Christo",male,NaN,0,0,349234,7.8958,NaN,S

3. What is the data type of cols?

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

4. Are there any missing values?

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

5. How does the data look mathematically?

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

6. Are there duplicate values?

In [11]:
df.duplicated().sum()

np.int64(0)

7. How is the correlation between cols?

In [12]:
df.corr(numeric_only=True)['Survived']

PassengerId   -0.005007
Survived       1.000000
Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
Parch          0.081629
Fare           0.257307
Name: Survived, dtype: float64

8. Column Names

In [13]:
# Display all column names
print("üìã Column Names:\n")
print(df.columns.tolist())
print(f"\n‚úÖ Total {len(df.columns)} columns")

üìã Column Names:

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

‚úÖ Total 12 columns

9. Data Types Summary

In [14]:
# Count of each data type
print("üìä Data Type Distribution:\n")
print(df.dtypes.value_counts())

üìä Data Type Distribution:

int64      5
object     5
float64    2
Name: count, dtype: int64

10. Detailed Statistics

In [15]:
# More detailed statistics including percentiles
print("üìä Detailed Statistical Summary:\n")
df.describe(percentiles=[.1, .25, .5, .75, .9, .95, .99])

üìä Detailed Statistical Summary:

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
10%,90.000000,0.000000,1.000000,14.000000,0.000000,0.000000,7.550000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
90%,802.000000,1.000000,3.000000,50.000000,1.000000,2.000000,77.958300
95%,846.500000,1.000000,3.000000,56.000000,3.000000,2.000000,112.079150
99%,882.100000,1.000000,3.000000,65.870000,5.000000,4.000000,249.006220
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

11. Statistics for All Columns

In [16]:
# Include categorical columns in summary
print("üìã Statistical Summary (All Features):\n")
df.describe(include='all')

üìã Statistical Summary (All Features):

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dooley, Mr. Patrick",male,NaN,NaN,NaN,347082,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

12. Unique Value Counts

In [17]:
# Count unique values in each column
print("üî¢ Unique Value Counts:\n")
unique_counts = df.nunique().sort_values(ascending=False)
print(unique_counts)

üî¢ Unique Value Counts:

PassengerId    891
Name           891
Ticket         681
Fare           248
Cabin          147
Age             88
SibSp            7
Parch            7
Embarked         3
Pclass           3
Survived         2
Sex              2
dtype: int64

13. Mean, Median, Mode

In [18]:
# Calculate mean, median, mode for numerical columns
print("üìà Central Tendency Measures:\n")
numerical_cols = df.select_dtypes(include=['int64', 'float64']).columns
for col in numerical_cols:
    print(f"\n{col}:")
    print(f"  Mean: {df[col].mean():.2f}")
    print(f"  Median: {df[col].median():.2f}")
    print(f"  Mode: {df[col].mode().values[0] if len(df[col].mode()) > 0 else 'N/A'}")

üìà Central Tendency Measures:


PassengerId:
  Mean: 446.00
  Median: 446.00
  Mode: 1

Survived:
  Mean: 0.38
  Median: 0.00
  Mode: 0

Pclass:
  Mean: 2.31
  Median: 3.00
  Mode: 3

Age:
  Mean: 29.70
  Median: 28.00
  Mode: 24.0

SibSp:
  Mean: 0.52
  Median: 0.00
  Mode: 0

Parch:
  Mean: 0.38
  Median: 0.00
  Mode: 0

Fare:
  Mean: 32.20
  Median: 14.45
  Mode: 8.05

14. Standard Deviation & Variance

In [19]:
# Calculate standard deviation and variance
print("üìä Dispersion Measures:\n")
for col in numerical_cols:
    print(f"\n{col}:")
    print(f"  Std Deviation: {df[col].std():.2f}")
    print(f"  Variance: {df[col].var():.2f}")
    print(f"  Range: {df[col].max() - df[col].min():.2f}")

üìä Dispersion Measures:


PassengerId:
  Std Deviation: 257.35
  Variance: 66231.00
  Range: 890.00

Survived:
  Std Deviation: 0.49
  Variance: 0.24
  Range: 1.00

Pclass:
  Std Deviation: 0.84
  Variance: 0.70
  Range: 2.00

Age:
  Std Deviation: 14.53
  Variance: 211.02
  Range: 79.58

SibSp:
  Std Deviation: 1.10
  Variance: 1.22
  Range: 8.00

Parch:
  Std Deviation: 0.81
  Variance: 0.65
  Range: 6.00

Fare:
  Std Deviation: 49.69
  Variance: 2469.44
  Range: 512.33

15. Skewness & Kurtosi

In [20]:
# Calculate skewness and kurtosis
print("üìâ Distribution Shape:\n")
for col in numerical_cols:
    print(f"\n{col}:")
    print(f"  Skewness: {df[col].skew():.2f}")
    print(f"  Kurtosis: {df[col].kurtosis():.2f}")

üìâ Distribution Shape:


PassengerId:
  Skewness: 0.00
  Kurtosis: -1.20

Survived:
  Skewness: 0.48
  Kurtosis: -1.78

Pclass:
  Skewness: -0.63
  Kurtosis: -1.28

Age:
  Skewness: 0.39
  Kurtosis: 0.18

SibSp:
  Skewness: 3.70
  Kurtosis: 17.88

Parch:
  Skewness: 2.75
  Kurtosis: 9.78

Fare:
  Skewness: 4.79
  Kurtosis: 33.40